import datetime
import random
import hashlib

where_or_when = [
    '家里',
    '学校中',
    '食堂中',
    '马路上',
    '地球上',
    '火星上',
    '打小怪兽时',
    '修仙时',
    '渡劫时',
    '极度愤怒时'
]

can_do = [
    '火系禁咒',
    '水系禁咒',
    '冰系禁咒',
    '自然系禁咒',
    '风系禁咒',
    '雷系禁咒',
    '金属系禁咒',
    '土系禁咒',
    '光系禁咒',
    '暗系禁咒',
    '火系魔法',
    '水系魔法',
    '冰系魔法',
    '自然系魔法',
    '风系魔法',
    '雷系魔法',
    '金属系魔法',
    '土系魔法',
    '光系魔法',
    '暗系魔法',
    '时间停止',
    '时间流速操控',
    '预知未来',
    '瞬间移动',
    '传送',
    '空间折叠',
    '遁术',
    '空间固化',
    '穿墙术',
    '重力操控',
    '矢量操作',
    '热能操控',
    '电力操控',
    '磁力操控',
    '超电磁炮',
    '音波操控',
    '能量操控',
    '金属操控',
    '物质重组',
    '未元物质',
    '反物质操控',
    '物品复制',
    '意念具现化',
    '石化',
    '隐身',
    '分身',
    '飞行',
    '拟态',
    '变身',
    '附身',
    '通灵',
    '身体交换',
    '复活',
    '快速愈合',
    '缩小化',
    '巨大化',
    '自爆',
    '生命吸取',
    '生命共享',
    '伤害转移',
    '念动力',
    '心灵控制',
    '意识交换',
    'AT力场',
    '意识交换',
    '灵魂转移',
    '言灵',
    '大沉默术',
    '读心术',
    '记忆同步',
    '千里眼',
    '透视',
    '夜视',
    '直死之魔眼',
    '幻惑之瞳',
    '破幻之瞳',
    '真实视野',
    '视域共享',
    '邪王真眼',
    '心眼',
    '眼部光束',
    '御剑术',
    '大回复术',
    '无限剑制'
]

but = [
    '用一次掉一根头发',
    '用了就会性转',
    '一天只能用一次',
    '只能在没人的时候才能用',
    '用了100%会被别人看见',
    '用了后会饥肠辘辘'
]


def superpower(user_id: int) -> str:
    # 用qq、日期生成随机种子
    random_seed_str = str([user_id, datetime.date.today()])
    md5 = hashlib.md5()
    md5.update(random_seed_str.encode('utf-8'))
    random_seed = md5.hexdigest()
    random.seed(random_seed)
    condition = random.sample(where_or_when, k=1)[0]
    power = random.sample(can_do, k=1)[0]
    effects = random.sample(but, k=1)[0]

    result = f"今天的超能力是:\n在{condition}可以使用【{power}】, 但是{effects}"
    return result
